// 1 - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
// let namber1 = +prompt('Введі число 1')
// let namber2 = +prompt('Введі число 2')
// let namber3 = (namber1+namber2)
// if (namber1 === namber2){
//     alert('Введені рівні числа, сумма'+namber3)
// }
// else {
//     alert ('Це ваше максимальне число '+namber3)
// }


// 2 - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// let home = +prompt(' Введіть номер квартири')
// if (home >=1 && home <=20){
//     alert('Квартира №' +home+', підїзд 1')
// }
// if (home >=21 && home <=48){
//     alert('Квартира №' +home+', підїзд 2')
// }
// if (home >=49 && home <=90)
//     alert('Квартира №' +home+', підїзд 3')
//
// else {
//     alert('Вибачте але в цьому будинку відсутня квартира №'+home)
// }


// 3 - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
// let number = +prompt('Чи зможеш ти ввети число 10?')
// if ( number === 10){
//     alert('ВІРНО')}
// else{
//     alert('НЕВІРНО')
// }


// 4 - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
// let x;
// if (typeof x === 'number'){
//     alert('number')
// }else if (typeof x === 'string'){
//     alert('string')
// }else if (typeof x === 'boolean'){
//     alert('boolean')
// }else if (typeof x === 'object'){
//     alert('object')
// }


// 5 - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let okten = prompt('яка температура на вулиці?')
// if (okten >= 10 && okten <= 22){
//     alert('Вчитися')
// }
// else {alert('Онлайн')}


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
// let prais = +prompt('Обирай свій приз, назви число від 1 до 5')
// switch (prais) {
//     case 1 :
//         alert('Мої вітання, ти втграв путівку на канари!')
//         break
//     case 2 :
//         alert('Мої вітання, ти втграв годину караоке!')
//         break
//     case 3 :
//         alert('Мої вітання, ти виграв Морозиво!')
//         break
//     case 4 :
//         alert('Мої вітання, ти отримаєш по шиї!')
//         break
//     case 5 :
//         alert('Мої вітання, ти старого кота!')
//         break
//     default:
//         alert('нажаль ти впустив свій шанс!')
// }
