// 1 - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let frends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]
//
// if (frends.length > 3) {
//     alert('Це досить великий масив')
// }
// else if (frends.length < 3)
//     alert('Це маленький малий')




// 2 - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let a = +prompt('Введіть перше число')
// let b = +prompt('Введіть друге  число')
// let c = +prompt( 'Введіть дретє число')
//
// if ( b>a && a>c ||b<a && a<c )
// {
//     alert('перше число середнє')
// }
// else if(a>b && b>c ||a<b && b<c)
// {
//     alert('Друге число середгє')
// }
// else if (a>c&&c>b || a<c && c<b)
// {
//     alert('Третє число середнє')
// }
// else {
//     alert('Ти вводиш щось не те')
// }




// 3 - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4)
// {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let result;
// result = (a + b < 4) ? 'Мало' : 'Багато'




// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let dey = +prompt('введіть число від -100 до 100')
if (dey  <0 ){
    alert('число з негативним значенням')
}
if (dey >0  ){
    alert('число з позитивним значенням')
}
if (dey === 0){
    alert('Ви ввели 0')
}
